 #include <Windows.h>
#include <iostream>
#include <string>
#include <time.h>
 


using namespace std;
void Print( const std::string& str)
{
	constexpr size_t width = 25;
	const size_t needChars = width - str.length();
	std::cout << str << std::string(needChars, ' ') ;
}
struct word {
	string name;
	int num;
public:
	string fun_name() {
		return name;
	}
	int fun_num() {
		return num;
	}
	 
	 
};
word allWords[]{
{"аркушик"					,	1	}  ,
{"бешкет"					,	1	}  ,
{"благовіст"				,	1	}  ,
{"ваги"						,	1	}  ,
{"випадок"					,	1	}  ,
{"висіти"					,	1	}  ,
{"витрата"					,	1	}  ,
{"відгомін"					,	1	}  ,
{"вірші"					,	1	}  ,
{"дано"						,	1	}  ,
{"дещиця"					,	1	}  ,
{"дивлячись"				,	1	}  ,
{"догмат"					,	1	}  ,
{"донька"					,	1	}  ,
{"дрова"					,	1	}  ,
{"загадка"					,	1	}  ,
{"закладка"					,	1	}  ,
{"закрутка"					,	1	}  ,
{"запонка"					,	1	}  ,
{"заставка"					,	1	}  ,
{"застібка"					,	1	}  ,
{"звисока"					,	1	}  ,
{"здалека"					,	1	}  ,
{"зозла"					,	1	}  ,
{"зрання"					,	1	}  ,
{"зручний"					,	1	}  ,
{"камбала"					,	1	}  ,
{"кишка"					,	1	}  ,
{"колесо"					,	1	}  ,
{"колія"					,	1	}  ,
{"косий"					,	1	}  ,
{"кроїти"					,	1	}  ,
{"курятина"					,	1	}  ,
{"лате"						,	1	}  ,
{"люстро"					,	1	}  ,
{"маркетинг"				,	1	}  ,
{"наскрізний"				,	1	}  ,
{"начинка"					,	1	}  ,
{"ніздря"					,	1	}  ,
{"олень"					,	1	}  ,
{"оцет"						,	1	}  ,
{"пекарський"				,	1	}  ,
{"підлітковий"				,	1	}  ,
{"подруга"					,	1	}  ,
{"позначка"					,	1	}  ,
{"приморозок"				,	1	}  ,
{"причіп"					,	1	}  ,
{"проділ"					,	1	}  ,
{"разом"					,	1	}  ,
{"ремінь"					,	1	}  ,
{"решето"					,	1	}  ,
{"ринковий"					,	1	}  ,
{"розпірка"					,	1	}  ,
{"свердло"					,	1	}  ,
{"сеча"						,	1	}  ,
{"спина"					,	1	}  ,
{"статуя"					,	1	}  ,
{"тигровий"					,	1	}  ,
{"тулуб"					,	1	}  ,
{"фольга"					,	1	}  ,
{"форзац"					,	1	}  ,
{"царина"					,	1	}  ,
{"центнер"					,	1	}  ,
{"щелепа"					,	1	}  ,
{"щипці" 					,	1	}  ,
{ "близький"				,	2	}  ,
{ "бородавка"				,	2	}  ,
{ "босоніж"					,	2	}  ,
{ "боязнь"					,	2	}  ,
{ "видання"					,	2	}  ,
{ "визвольний"				,	2	}  ,
{ "вимога"					,	2	}  ,
{ "виразний"				,	2	}  ,
{ "вишиваний"				,	2	}  ,
{ "вітчим"					,	2	}  ,
{ "глядач"					,	2	}  ,
{ "граблі"					,	2	}  ,
{ "гуртожиток"				,	2	}  ,
{ "данина"					,	2	}  ,
{ "де-юре"					,	2	}  ,
{ "дичавіти"				,	2	}  ,
{ "добуток"					,	2	}  ,
{ "довідник"				,	2	}  ,
{ "дочка"					,	2	}  ,
{ "експерт"					,	2	}  ,
{ "завдання"				,	2	}  ,
{ "заміжня"					,	2	}  ,
{ "застопорити"				,	2	}  ,
{ "зібрання"				,	2	}  ,
{ "зубожіння"				,	2	}  ,
{ "індустрія"				,	2	}  ,
{ "квартал"					,	2	}  ,
{ "кінчити"					,	2	}  ,
{ "корисний"				,	2	}  ,
{ "котрий"					,	2	}  ,
{ "крицевий"				,	2	}  ,
{ "літопис"					,	2	}  ,
{ "мережа"					,	2	}  ,
{ "навчання"				,	2	}  ,
{ "напій"					,	2	}  ,
{ "ненавидіти"				,	2	}  ,
{ "ненависний"				,	2	}  ,
{ "ненависть"				,	2	}  ,
{ "нести"					,	2	}  ,
{ "новий"					,	2	}  ,
{ "обруч"					,	2	}  ,
{ "ознака"					,	2	}  ,
{ "оптовий"					,	2	}  ,
{ "отаман"					,	2	}  ,
{ "павич"                   ,   2	}  ,
{ "партер"                  ,   2   }  ,
{ "перепад"					,	2   }  ,
{ "перепис"					,	2   }  ,
{ "пізнання"				,	2   }  ,
{ "пітний"					,	2   }  ,
{ "піцерія"					,	2   }  ,
{ "поміщик"					,	2   }  ,
{ "помовчати"				,	2   }  ,
{ "поняття"					,	2   }  ,
{ "проміжок"				,	2   }  ,
{ "рівнина"					,	2   }  ,
{ "рукопис"					,	2   }  ,
{ "русло"					,	2   }  ,
{ "середина"				,	2   }  ,
{ "стрибати"				,	2   }  ,
{ "тисовий"					,	2   }  ,
{ "тризуб"					,	2   }  ,
{ "фартух"					,	2   }  ,
{ "феномен"					,	2   }  ,
{ "цемент"					,	2   }  ,
{ "цінник"					,	2   }  ,
{ "читання"					,	2   }  ,
{ "чорнозем"				,	2   }  ,
{ "чорнослив"				,	2   }  ,
{ "шовковий"				,	2   }  ,
{ "шофер"					,	2   }  ,
{ "агрономія"				,	3   }  ,
{ "безпринципний"			,	3   }  ,
{ "болотистий"				,	3   }  ,
{ "бурштиновий"				,	3   }  ,
{ "бюлетень"				,	3   }  ,
{ "вантажівка"				,	3   }  ,
{ "відвезти"				,	3   }  ,
{ "відвести"				,	3   }  ,
{ "віднести"				,	3   }  ,
{ "віршовий"				,	3   }  ,
{ "горошина"				,	3   }  ,
{ "дециметр"				,	3   }  ,
{ "джерело"					,	3   }  ,
{ "діалог"					,	3   }  ,
{ "добовий"					,	3   }  ,
{ "довезти"					,	3   }  ,
{ "донести"					,	3   }  ,
{ "єретик"					,	3   }  ,
{ "жалюзі"					,	3   }  ,
{ "завезти"					,	3   }  ,
{ "завести"					,	3   }  ,
{ "завчасу"					,	3   }  ,
{ "заіржавілий"				,	3   }  ,
{ "заіржавіти"				,	3   }  ,
{ "закінчити"				,	3   }  ,
{ "залишити"				,	3   }  ,
{ "занести"					,	3   }  ,
{ "заробіток"				,	3   }  ,
{ "зобразити"				,	3   }  ,
{ "каталог"					,	3   }  ,
{ "кілометр"				,	3   }  ,
{ "кропива"					,	3   }  ,
{ "кулінарія"				,	3   }  ,
{ "листопад"				,	3   }  ,
{ "магістерський"			,	3   }  ,
{ "металургія"				,	3   }  ,
{ "міліметр"				,	3   }  ,
{ "нанести"					,	3   }  ,
{ "обіцянка"				,	3   }  ,
{ "одинадцять"				,	3   }  ,
{ "осетер"					,	3   }  ,
{ "піала"					,	3   }  ,
{ "порядковий"				,	3   }  ,
{ "посередині"				,	3   }  ,
{ "привезти"				,	3   }  ,
{ "привести"				,	3   }  ,
{ "принести"				,	3   }  ,
{ "псевдонім"				,	3   }  ,
{ "роздрібний"				,	3   }  ,
{ "сантиметр"				,	3   }  ,
{ "симетрія"				,	3   }  ,
{ "сімдесят"				,	3   }  ,
{ "соломинка"				,	3   }  ,
{ "стовідсотковий"			,	3   }  ,
{ "текстовий"				,	3   }  ,
{ "течія"					,	3   }  ,
{ "тім’яний"				,	3   }  ,
{ "травестія"				,	3   }  ,
{ "український"				,	3   }  ,
{ "уподобання"				,	3   }  ,
{ "урочистий"				,	3   }  ,
{ "усередині"				,	3   }  ,
{ "фаховий"					,	3   }  ,
{ "чарівний"				,	3   }  ,
{ "черговий"				,	3   }  ,
{ "чотирнадцять"			,	3   }  ,
{ "ярмарковий"				,	3   }  ,
{ "асиметрія"				,	4   }  ,
{ "одноразовий"				,   4   }  ,
{ "перевезти"				,   4   }  ,
{ "перенести"				,   4   }  ,
{ "шляхопровід"				,   4   }  ,
{ "щодобовий"				,   4   }  ,
{ "багаторазовий"			,	5   }  ,
{ "сільськогосподарський"	,	5   }  ,
};
const unsigned int len = (sizeof(allWords) / sizeof(allWords[0]))-1;

int getRandomNumber(unsigned int max)
{
	
	static const double fraction = 1.0 / (static_cast<double>(RAND_MAX) + 1.0);
	 
	return static_cast<int>(rand() * fraction * (static_cast<double>(max)  + 1) );
}

void out_all_words() {
	for (word i : allWords) {
		Print(i.fun_name());
		cout << " - " << i.fun_num() << '\n';
	}
}

void out_some_words() {
	int which;
	cout << "На який склад наголос?" << "\n" << "від 1 до 5 :    ";
	cin >> which;
	for (word i : allWords) {
		if (which == i.fun_num()) {
			cout << i.fun_name() << '\n';
		}
	}
}

void infinity() {
	unsigned int human_in;
	do {
		int rand = getRandomNumber(len);
		cout << allWords[rand].fun_name() << "\n";
		cout << "Ведіть на який склад падає наголос або 0 для виходу:     ";
		cin >> human_in;
		if (human_in == allWords[rand].fun_num()) {
			cout << "	   Правильно:)\n";
		}
		else if(human_in!=0)
			cout << "			Не правильно:(     наголос на "<<allWords[rand].fun_num() << " склад" << "\n";
	} while (human_in != 0);
};

void infinity_num(int num) {
	unsigned int chek(0);
	
	unsigned int human_in;
	for (int i = 0; i < num; i++) {
		int rand = getRandomNumber(len);
		cout << allWords[rand].fun_name() << "\n";
		cout << "Ведіть на який склад падає наголос:   ";
		cin >> human_in;
		if (human_in == allWords[rand].fun_num()) {
			cout << "				Правильно:)\n";
			chek++;
		}
		else
			cout << "			Не правильно:(     наголос на " << allWords[rand].fun_num() << " склад" << "\n";
		
	}
	cout << "Ви відповіли правильно " << chek << " із " << num << "\n\n";
	if (chek >= (0.9 * num))
		cout << "Вітаю\n\n";
	else
		cout << "Пробуй ще\n\n";

}

void infinity_sequence() {
	unsigned int human_in;
	int count = 0;
	do {
		 
		cout << allWords[count].fun_name() << "\n";
		cout << "Ведіть на який склад падає наголос або 0 для виходу:     ";
		cin >> human_in;
		if (human_in == allWords[count].fun_num()) {
			cout << "				Правильно:)\n";
		}
		else if (human_in != 0) {
			cout << "			Не правильно:(     наголос на " << allWords[count].fun_num() << " склад" << "\n";
		}
		if (count <=  len) {
			count++;
		}
		else {
			cout << "Ви пройшли всі слова\n"<<"Бажаєте почати спочатку?\n"<<"Так - 1, Ні - 0\n";
			cin >> human_in;
			if (human_in == 1) {
				infinity_sequence();
			}

		}
	} while (human_in != 0);
}

void start() {
	unsigned int human_choice;
	int chekk=0;
	do {
		if (chekk == 0)
		{
			cout << "Що ви хочете зробити:\n" << "1 - вивести всі слова\n" << "2 - вивести слова з наголосом на певний склад\n" << "3 - перевірити свої знання\n" << "4 - закінчити роботу\n";
			chekk++;
		}
		else if(chekk == 1)
			cout << "Що ви хочете зробити далі:\n" << "1 - вивести всі слова\n" << "2 - вивести слова з наголосом на певний склад\n" << "3 - перевірити свої знання\n" << "4 - закінчити роботу\n";
		cin >> human_choice;
		switch (human_choice) {
		case 1: out_all_words();
			break;
		case 2: out_some_words();
			break;
		case 3: {
			cout << "Виберіть режим:\n"<< "1 - нескінчений режим \n"<<"2 - певна кількість слів\n"<< "3 - всі слова підряд\n";
			int choice_mode;
			cin >> choice_mode;
			if (choice_mode == 1) 
				infinity();
			if (choice_mode == 2) {
				cout << "Скільки слів?    ";
				int num_word;
				cin >> num_word;
				infinity_num(num_word);
			}
			if (choice_mode == 3)
				infinity_sequence();
		}
			  break;
		case 4: break;

		default: {
			cout << "Ви ввели некоректне число. Спробуйте ще раз\n";
			break;
		}

		}
	} while (human_choice !=4);
}
int main()
{
	srand(static_cast<unsigned int> (time(0)));
	rand();
 
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	 
	start();


}
 
